/**************************** (C) COPYRIGHT 2015 Fortiortech shenzhen *****************************
* File Name          : CMPInit.c
* Author             : Fortiortech  Market Dept
* Version            : V1.0
* Date               : 01/07/2015
* Description        : This file contains CMP initial function used for Motor Control.
***************************************************************************************************
* All Rights Reserved
**************************************************************************************************/ 


/* Includes -------------------------------------------------------------------------------------*/
#include <FU68xx.h>
#include <Myproject.h>


/*-------------------------------------------------------------------------------------------------
	Function Name :	void CMP_Iint(void)
	Description   :	比较器初始化
	Input         :	无
  Output				:	无
-------------------------------------------------------------------------------------------------*/
void CMP_Iint(void)
{	
/*-------------------------------------------------------------------------------------------------
	CMP Input Pin Mode
	0: GPIO Mode, P1.4--CMP0_IN+, P1.6--CMP1_IN+, P2.1--CMP2_IN+
	              P1.5--CMP0_IN-, P1.7--CMP1_IN-, P2.2--CMP2_IN-
	1: BEMF Mode, 比较器正端连接到内部星型连接电阻U、V、W的BMEF采样点，
	              比较器负端连接到内部星型连接电阻的虚拟中性点
	              比较器负端与P1.5/P1.7/P2.2断开，这三个GPIO可做其他用途
-------------------------------------------------------------------------------------------------*/
	SetBit(P1_AN, P14, 1);
 	SetBit(P1_AN, P15, 1);                                 // CMP0
 	SetBit(P1_AN, P16, 1);
 	SetBit(P1_AN, P17, 1);                                 // CMP1
	SetBit(P2_AN, P21, 1);
 	SetBit(P2_AN, P22, 1);	                               // CMP2
	
	SetBit(P2_AN, P26, 1);
	SetBit(P2_AN, P27, 1);	                                 // CMP3
	SetBit(CMP_CR1, BEMFREN, 1);		
	
/*-------------------------------------------------------------------------------------------------
	比较器迟滞电压选择
	000: 无迟滞   001: -5mV   010: +5mV   011: +-5mV
	100: 无迟滞   101: -9mV   110: +9mV   111: +-9mV
-------------------------------------------------------------------------------------------------*/
	SetBit(CMP_CR1, CMP3HYS2, 1);
	SetBit(CMP_CR1, CMP3HYS1, 1);
	SetBit(CMP_CR1, CMP3HYS0, 1);                            // 比较器3滞电压+-9mv
	SetBit(CMP_CR1, CMP0HYS2, 0);
	SetBit(CMP_CR1, CMP0HYS1, 1);
	SetBit(CMP_CR1, CMP0HYS0, 1);	                           // 比较器0~2滞电压+-9mv

/*比较器0~2输出采样使能--------------------------------------------------------------------------*/
	SetBit(CMP_CR2, CMPSAME, 0);		                         // disable CMP output	

/*比较器输出选择配置-----------------------------------------------------------------------------*/
	SetBit(CMP_CR2, CMPSEL1, 0);	
	SetBit(CMP_CR2, CMPSEL0, 0);	                           // select CMP0 output
 	SetBit(CMP_CR2, CMPOE, 1);		                         // enable CMP output		//使用FOC_SPI时，关闭
 	SetBit(P0_OE, P07, 1);

/*-------------------------------------------------------------------------------------------------
	比较器中断模式配置
	00: 不产生中断  01: 上升沿产生中断  10: 下降沿产生中断  11: 上升/下降沿产生中断
-------------------------------------------------------------------------------------------------*/
	CMP_SR &= 0xf0;								                           // clear interrupt flag	
	SetBit(CMP_CR0, CMP3IM1, 0);
	SetBit(CMP_CR0, CMP3IM0, 1); 

	PCMP1 = 1;
	PCMP0 = 1;									                             // 中断优先级别3
	EA = 1;
	
	/*比较器使能-------------------------------------------------------------------------------------*/
 	SetBit(CMP_CR2, CMP2EN, 0);                             // 使能CMP2
 	SetBit(CMP_CR2, CMP1EN, 0);                             // 使能CMP1
 	SetBit(CMP_CR2, CMP0EN, 0);                             // 使能CMP0
	SetBit(CMP_CR2, CMP3EN, 1);															// 使能CMP3
	
	/*-------------------------------------------------------------------------------------------------
	MOE Protect Config
	1、硬件保护使能，触发硬件保护后硬件关闭驱动输出MOE=0，同时产生硬件保护中断
	2、选择硬件保护触发信号源，外部中断0或者比较器3中断。
	3、硬件保护触发信号滤波配置。
	   00-4cpu clock    01-8cpu clock    10-16cpu clock    11-24cpu clock 
-------------------------------------------------------------------------------------------------*/	
	SetBit(EVT_FILT,EFSRC,0);   // 母线电流保护事件的滤波模块输入来源: 1-INT0, 0-CMP3
	SetBit(EVT_FILT,MCLREN,1);  // MOE信号硬件清零使能		

	SetBit(EVT_FILT,EFEN,1);    // 母线电流保护事件滤波使能	

	SetBit(EVT_FILT,EFDIV1,0);  // 母线电流保护事件滤波宽度
	SetBit(EVT_FILT,EFDIV0,0);
	
/*比较器使能------------------------------------------------------------------------*/
	CLR(CMP_SR, CMP3INTR);
}

