/**************************** (C) COPYRIGHT 2015 Fortiortech shenzhen *****************************
* File Name          : SystemInit.c
* Author             : Fortiortech  Market Dept
* Version            : V1.0
* Date               : 01/07/2015
* Description        : This file contains system initial function used for Motor Control.
***************************************************************************************************
* All Rights Reserved
**************************************************************************************************/ 


/* Includes -------------------------------------------------------------------------------------*/
#include <FU68xx.h>
#include <Myproject.h>


/*-------------------------------------------------------------------------------------------------
	Function Name :	void SystemInit(void)
	Description   :	系统初始化，包括系统时钟初始化，系统电源初始化，看门狗配置，硬件过流保护配置
	Input         :	无
	Output		  :	无
-------------------------------------------------------------------------------------------------*/
void SystemInit(void)
{
/*-------------------------------------------------------------------------------------------------
	System Clock Config
	1、ExternalSlowClockConfig(Status)
	   配置不使能外部慢时钟（RTC时钟）
-------------------------------------------------------------------------------------------------*/
	
/*-------------------------------------------------------------------------------------------------
	System Power Config
	1、掉电低电压预警中断使能
	2、掉电检测电路使能
	3、ADC参考电压配置
-------------------------------------------------------------------------------------------------*/
	SetBit(CCFG2, LVRSEL1, 1);
	SetBit(CCFG2, LVRSEL0, 1);												//配置3.8V复位功能，但没有警告中断
	
	SetBit(VREF_CR, VREFEN, 1);												//ADC参考电压使能
	SetBit(VREF_CR, VREFVSEL1, 1);
	SetBit(VREF_CR, VREFVSEL0, 0);											//ADC参考电压配置为4.5V
	
/*-------------------------------------------------------------------------------------------------
	WatchDog Config
	1、设置看门狗定时时间，单位ms，最小定时时间8ms，最大定时1800ms
	2、看门狗不使能使能
-------------------------------------------------------------------------------------------------*/
}

